In [12]:
import pandas as pd
import pyodbc

In [32]:
a=pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-T7O2HU7\SQLEXPRESS01; DATABASE=test')

In [34]:
cursor =a.cursor()

In [17]:
cursor.execute('select * from [emp] where ')

In [18]:
tables = cursor.fetchall()

In [27]:
tables

[(1, 'vikas', 'A', 60, datetime.datetime(2013, 2, 15, 11, 16, 28, 290000), 'IT', 'Male'),
 (2, 'ambika', 'B', 53, datetime.datetime(2014, 1, 9, 17, 31, 7, 793000), 'HR', 'Female'),
 (3, 'Ashish', 'C', 10, datetime.datetime(2014, 1, 9, 10, 5, 7, 793000), 'IT', 'Male'),
 (4, 'Nikhil', 'Sharma', 48, datetime.datetime(2014, 1, 9, 9, 0, 7, 793000), 'HR', 'Male'),
 (5, 'Anish', 'Kadian', 50, datetime.datetime(2014, 1, 9, 9, 31, 7, 793000), 'Payroll', 'Male')]

In [38]:
dat= []
for row in tables:
    
    dat.append({'Name':row.FirstName, 'Class': row.Salary})
df = pd.DataFrame(dat)

In [41]:
df2=df[df['Name']=='Nikhil']

In [42]:
df2

   Class    Name
3     48  Nikhil

In [46]:
df2.drop('Name',axis=1)

   Class
3     48

In [48]:
df.to_excel('momo.xlsx')